<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"d6cb4c641430227e9f936ad1a9df445625e6a7baf7eda65c992b4c34832483bc","plan_job_ref":"Job Create terraform plan for Palo Alto Panorama Add-on #20 at https://github.com/AFMPE/mpe_palo_alto/actions/runs/7658452072","plan_hash":"5a14392daa782266db163705c4f79129086c260167d0747878f0052539b3e8a4","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __infrastructure/terraform__
With backend config: `storage_account_name=afmpetfmgtprodh9df3erta
container_name=paloalto            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `infrastructure/terraform/tfvars/parameters.tfvars
`<details open><summary>With variables</summary>

```hcl
jumpbox_vm_admin_password         = "lT16^UIoTx%bsDvaDu!B"
panorama_vm_admin_ssh_private_key = (sensitive value)
panorama_vm_admin_ssh_public_key  = (sensitive value)
production_subscription_id        = (sensitive value)
spoke_subscription_id             = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_key_vault_secret.panorama-server-ssh-key will be created
  + resource "azurerm_key_vault_secret" "panorama-server-ssh-key" {
      + id                      = (known after apply)
      + key_vault_id            = "*********************************************************************************************************************************************************"
      + name                    = "Panorama-Server-SSH-Key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.azurerm_linux_virtual_machine.linux_vm[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_linux_virtual_machine" "linux_vm" {
      - admin_username                                         = "azureadmin" -> null
      - allow_extension_operations                             = true -> null
      - bypass_platform_safety_checks_on_user_schedule_enabled = false -> null
      - computer_name                                          = "ampe-eus-panorama-jumpbox-prod-vm" -> null
      - disable_password_authentication                        = true -> null
      - encryption_at_host_enabled                             = false -> null
      - extensions_time_budget                                 = "PT1H30M" -> null
      - id                                                     = "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Compute/virtualMachines/ampe-eus-panorama-jumpbox-prod-vm" -> null
      - location                                               = "eastus" -> null
      - max_bid_price                                          = -1 -> null
      - name                                                   = "ampe-eus-panorama-jumpbox-prod-vm" -> null
      - network_interface_ids                                  = [
          - "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Network/networkInterfaces/ampe-eus-panorama-jumpbox-prod-nic",
        ] -> null
      - patch_assessment_mode                                  = "ImageDefault" -> null
      - patch_mode                                             = "ImageDefault" -> null
      - platform_fault_domain                                  = -1 -> null
      - priority                                               = "Regular" -> null
      - private_ip_address                                     = "192.168.1.5" -> null
      - private_ip_addresses                                   = [
          - "192.168.1.5",
        ] -> null
      - provision_vm_agent                                     = true -> null
      - public_ip_addresses                                    = [] -> null
      - resource_group_name                                    = "ampe-eus-id-prod-rg" -> null
      - secure_boot_enabled                                    = false -> null
      - size                                                   = "Standard_D16ls_v5" -> null
      - tags                                                   = {
          - "ResourceName" = "ampe-eus-panorama-jumpbox-prod-vm"
          - "deployedBy"   = "AzureNoOpsTF [default]"
          - "env"          = "prod"
          - "workload"     = "panorama"
        } -> null
      - virtual_machine_id                                     = "0f9ef13f-7bb2-4b7d-aa90-055432c4a6bb" -> null
      - vtpm_enabled                                           = false -> null

      - additional_capabilities {
          - ultra_ssd_enabled = false -> null
        }

      - admin_ssh_key {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      - boot_diagnostics {}

      - os_disk {
          - caching                   = "ReadWrite" -> null
          - disk_size_gb              = 30 -> null
          - name                      = "ampe-eus-panorama-jumpbox-prod-vm_OsDisk_1_b6f6e8133c904ff58bc7e79ac0f6a127" -> null
          - storage_account_type      = "StandardSSD_LRS" -> null
          - write_accelerator_enabled = false -> null
        }

      - source_image_reference {
          - offer     = "UbuntuServer" -> null
          - publisher = "Canonical" -> null
          - sku       = "18.04-LTS" -> null
          - version   = "latest" -> null
        }
    }

  # module.mod_jumpbox_virtual_machine.azurerm_virtual_machine_extension.omsagentwin[0] will be created
  + resource "azurerm_virtual_machine_extension" "omsagentwin" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "OmsAgentForWindows"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                    = <<-EOT
            {
                  "workspaceId": "f4a6b291-6836-4823-8dba-d73fa97701fa"
                }
        EOT
      + type                        = "MicrosoftMonitoringAgent"
      + type_handler_version        = "1.0"
      + virtual_machine_id          = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.azurerm_windows_virtual_machine.win_vm[0] will be created
  + resource "azurerm_windows_virtual_machine" "win_vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "ampe-eus-10dd37"
      + enable_automatic_updates                               = false
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = false
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "ampe-eus-panorama-jumpbo"
      + network_interface_ids                                  = [
          + "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Network/networkInterfaces/ampe-eus-panorama-jumpbox-prod-nic",
        ]
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "AutomaticByPlatform"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ampe-eus-id-prod-rg"
      + size                                                   = "Standard_D16ls_v5"
      + tags                                                   = {
          + "ResourceName" = "ampe-eus-panora"
          + "deployedBy"   = "AzureNoOpsTF [default]"
          + "env"          = "prod"
          + "workload"     = "panorama"
        }
      + virtual_machine_id                                     = (known after apply)

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + boot_diagnostics {}

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan for Palo Alto Panorama Add-on #20](https://github.com/AFMPE/mpe_palo_alto/actions/runs/7658452072)